from time import *

risunok1 = [
    '            ⠄⠄⠄⠄⢀⣀⣤⣤⣤⣀⣀⣀⣀⡀',
    '⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣼⠟⠉⠉⠉⠉⠉⠉⠉⠙⠻⢶⣄',
    '⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣾⡏⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠙⣷⡀',
    '⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣸⡟⠄⣠⣶⠛⠛⠛⠛⠛⠛⠳⣦⡀⠄⠘⣿⡄',
    '⠄⠄⠄⠄⠄⠄⠄⠄⠄⢠⣿⠁⠄⢹⣿⣦⣀⣀⣀⣀⣀⣠⣼⡇⠄⠄⠸⣷',
    '⠄⠄⠄⠄⠄⠄⠄⠄⠄⣼⡏⠄⠄⠄⠉⠛⠿⠿⠿⠿⠛⠋⠁⠄⠄⠄⠄⣿⡄',
    '⠄⠄⠄⠄⠄⠄⠄⠄⢠⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢻⡇',
    '⠄⠄⠄⠄⠄⠄⠄⠄⣸⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢸⡇',
    '⠄⠄⠄⠄⠄⠄⠄⠄⣿⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢸⣧',
    '⠄⠄⠄⠄⠄⠄⠄⢸⡿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⣿',
    '⠄⠄⠄⠄⠄⠄⠄⣾⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿',
    '⠄⠄⠄⠄⠄⠄⠄⣿⠃⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿',
    '⠄⠄⠄⠄⠄⠄⢰⣿⠄⠄⠄⠄⣠⡶⠶⠿⠿⠿⠿⢷⣦⠄⠄⠄⠄⠄⠄⠄⣿',
    '⠄⠄⣀⣀⣀⠄⣸⡇⠄⠄⠄⠄⣿⡀⠄⠄⠄⠄⠄⠄⣿⡇⠄⠄⠄⠄⠄⠄⣿',
    '⣠⡿⠛⠛⠛⠛⠻⠄⠄⠄⠄⠄⢸⣇⠄⠄⠄⠄⠄⠄⣿⠇⠄⠄⠄⠄⠄⠄⣿',
    '⢻⣇⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣼⡟⠄⠄⢀⣤⣤⣴⣿⠄⠄⠄⠄⠄⠄⠄⣿',
    '⠈⠙⢷⣶⣦⣤⣤⣤⣴⣶⣾⠿⠛⠁⢀⣶⡟⠉⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⡟',
    '⠄⠄⠄⠄⠉⠉⠉⠉⠉⠄⠄⠄⠄⠄⠈⣿⣆⡀⠄⠄⠄⠄⠄⠄⢀⣠⣴⡾⠃',
    '⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠛⠻⢿⣿⣾⣿⡿⠿⠟⠋⠁'
]
risunok2 = [
'╱╱╱╱╱╭━╮╱╱╱╱╱',
'╱╱╱╱┣┫┊┣╱╱┏┓╱',
'╱╭━━━┛┊┗━━┛┃╱',
'╲╰━━━┓┊┏━━┓┃╲',
'╲╲╲╲┣┫┊┣╲╲┗┛╲',
'╲╲╲╲╲╰━╯╲╲╲╲╲',
]

die = [
'..._____...',
'../.....\..',
'./...|...\.',
'/..--+--.. ',
'\....|..../',
'.\......./.',
'..\...../..',
'...\___/...',

]




def print_delay(line, sec=0.05):
    for s in line:
        print(s, end='')
        sleep(sec)
    print()


print_delay('Легенда о первом блёбике')
sleep(1)
print_delay('Вы появились в неизвестном месте. Вы: "что, где я?"')
sleep(1)
print_delay('Пытаясь осознать ситуацию вы задали себе вопрос: "Куда я попал?"')
print_delay('Действия:')
sleep(0.5)
print_delay('1.Осмотреть территорию. 2.Остаться на месте.')
n3 = int(input())
while n3 != 1 and n3 != 2:
    n3 = int(input())
if n3 == 1:
    print_delay('вы поняли что на летающем острове')
    print_delay('Варинты:')
    print_delay('1.Подойти к краю. 2.Обыскать землю.')
    n = int(input())
    while n != 1 and n != 2:
        n = int(input())
    if n == 1:
        print_delay('Вы споткнулись и упали получено достижения: сама не аккуратность')
        print(*die, sep='\n')
    elif n == 2:
        print_delay('Вы нашли книгу самолёты для чайников почитав вы научились летать')
        print_delay('Варианты:')
        print_delay('1.Ждать 2.Продолжить осмотр территории')
        n1 = int(input())
        while n1 != 1 and n1 != 2:
            n1 = int(input())
        if n1 == 1:
            print_delay('Вы умерли от старостию "получено достижение:Гига Ждун"')
            print(*risunok1, sep='\n')
        elif n1 == 2:
            print_delay('Вы нашли самолёт')
            print(*risunok2, sep='\n')
            print_delay('Варианты:')
            print_delay('1.Улететь 2.Остаться на острове')
            n2 = int(input())
            while n2 != 1 and n2 != 2:
                n2 = int(input())
            if n2 == 1:
                print('вы вернулись к городской жизни')
            elif n2 == 2:
                print_delay('Вы умерли от старостиюб, получено достижение: Островетянин')
                print(*risunok1, sep='\n')
if n3 == 2:
    print_delay('Вы подождали')
    print_delay('Вас убил медведь. Достижение получено: корм животных')
    print(*die, sep='\n')